{
  "__timeline": [
    {
      "id": 1,
      "month": "JANUARY",
      "title": "SNS & TRACOM LAUNCH",
      "description": "The **Support Network Member (SNS)** program develops leaders via a chosen ecosystem. SLP participants must nominate three peers and three seniors to provide feedback. The network uses a survey, mapped to the Protiviti competency framework, at the start and end of the journey. Members must have a direct working relationship for relevant input.\n\n**TRACOM Social Style Questionnaire**\nNetwork members complete the **TRACOM Social Style Questionnaire** to highlight the participant's social style. This helps participants understand their own working style, communication, and motivations to improve stakeholder relationships and enhance their influencing ability."
    },
    {
      "id": 2,
      "month": "JANUARY",
      "title": "INDVIDUAL DEVELOPMENT PLANNING ",
      "description": "This 2-hour in-person session focuses on SNS report walkthrough with the explanation of Support Network Survey results to the participants. Participants will learn to understand the key insights of their report, identify patterns that highlight individual strengths and development areas, and collaboratively create a practical action plan to support personal and professional growth."
    },
    {
      "id": 3,
      "month": "FEBRUARY",
      "title": "ORIENTATION SESSION - INDIVIDUAL",
      "description": "The Orientation session is divided into five parts:\n\n<ol type=\"a\" style=\"list-style-type: lower-alpha;\"><li>SLP program introduction.</li><li>Senior leadership presence & keynote.</li><li>TRACOM social style session.</li><li>Creating integrated Personal Development Plan by analyzing the SNS survey inputs and TRACOM social style report.</li><li>Share executive coach alignment.</li></ol>"
    },
    {
      "id": 4,
      "month": "FEBRUARY END",
      "title": "EXECUTIVE COACHING",
      "description": "An Executive Coach will be aligned with each participant. The objective of the Executive Coach is to help participants work on the mutually agreed Personal Development Plan (PDP). A total of 5 sessions per participant will be assigned. Each executive coaching session will be for 90 minutes. Below mentioned are the list of executive coaches:   \n\n* Daljit Singh  \n* Mohan Das Menon  \n* Anita Bilani  \n* Rajiv Raju  \n* Yaadhav Mehra  \n* Preeti Singh  \n* Dr. George Dimitrelis"
    },
    {
      "id": 5,
      "month": "APRIL",
      "title": "TRAINING 1 - MAKE YOUR PRESENCE FELT",
      "description": "**Faculty – Elena Asgar, Mode – Classroom, Time – 2 Days**   \n“Make Your Presence Felt - in Boardrooms and Beyond” is a premium program designed for accomplished professionals who already excel as experts in their domain but need to strengthen their Executive Presence. The program helps participants develop leadership impact, visibility, image, and influence required to match their technical and business acumen. By focusing on advanced skills in public speaking, high-level communication, and client influence, it enables them to project a partner-worthy persona, win clients, attract top talent, and align with the stature of the Firm."
    },
    {
      "id": 6,
      "month": "MAY",
      "title": "MENTORING SESSION",
      "description": "**Mentoring (Maximum 3 mentees to 1 mentor)**  \nThe Mentoring Program spans six sessions. The first two focus on the mentee drafting and prioritizing a 6-month agenda (max 4 issues) and action plan, with the mentor providing initial advice. Sessions 3 and 4 involve progress review, status updates, and checking in with the mentee's manager for workplace changes. Session 5 is a mandatory face-to-face check-in focused on improving the mentor relationship and addressing potential growth roadblocks. Session 6 provides final detailed feedback and formally concludes the relationship.  \n\n\n**Role of Mentor (2-Hour Session)**  \n**Role of Mentor Training:** Understanding mentoring as an leadership development tool, outlining expectations, support, required mindset, and mitigating common challenges.\n\nList of potential mentors. \n\n* Sunil Chandiramani  \n* Anjani Agrawal  \n* Ambarish Dasgupta  \n* Sanjeev Agarwal  \n* EXCO members from India and Middle East"
    },
    {
      "id": 7,
      "month": "JULY",
      "title": "TRAINING 2 - CONSULTATIVE SELLING SKILLS/ACCOUNT MANAGEMENT SKILLS",
      "description": "(Yet to Get)"
    },
    {
      "id": 8,
      "month": "OCTOBER",
      "title": "TRAINING 3 - PRACTICAL & AUTHENTIC LEADERSHIP",
      "description": "**Faculty – Yaadhav Mehra, Mode – Classroom, Time – 2 Days**   \nPAL is a transformative 2-day workshop that navigates the paradox of being both practical and authentic. It helps leaders influence others while maintaining integrity. Through simulations and feedback, participants learn to delegate, develop unmotivated team members, and manage challenging personalities. The program encourages deep reflection and real-world experimentation to empower leaders to drive teams toward a desired future state with clarity and compassion."
    },
    {
      "id": 9,
      "month": "JANUARY",
      "title": "TRAINING 4 - HIGH IMPACT PRESENTATION",
      "description": "**Faculty – Dale Carnegie, Mode – Classroom, Time – 2 Days**   \nThis program focuses on immersive, hands-on learning to transform participants into compelling, influential speakers. Through videotaped assessments and personalized coaching, participants practice key techniques like message structuring, effective storytelling, and using visual aids. The goal is to build confidence, credibility, and practical skills to engage challenging audiences and achieve measurable business results."
    },
    {
      "id": 10,
      "month": "FEBRUARY",
      "title": "TRAINING 5 - RESIDENTIAL WORKSHOP AT ISB",
      "description": "**Faculty – Prof. Ravi Jain, Prof. Vishal Karungulam, Prof. Raj Rajeshwar Upadhyay, Time – 3 Days**  \nThis intensive 3-day workshop covers: **Driving Profitable Growth** (aligning operational and financial strategies for value creation); **AI Strategies for Business Transformation** (leveraging Generative AI for growth, considering ethics); and **Transformational Leadership** (fostering a growth mindset, managing disruption, and leading with emotional intelligence)."
    },
    {
      "id": 11,
      "month": "MARCH",
      "title": "CLOSURE REPORT - EXECUTIVE COACHING & MENTORING",
      "description": "Executive Coach to provide a report highlighting the efforts made and the progress made by the participant."
    },
    {
      "id": 12,
      "month": "MARCH MID",
      "title": "CLOSURE - SNS 2 & VERSATILITY 2",
      "description": "The same **support network** members to respond to the same survey at the end of the journey. This will allow the program sponsors, the Reporting Manager and the participant to understand the progress made during the program.   \n**TRACOM** Versatility report to be conducted again at the end of the program. This second report will allow the participants and other stakeholders to understand the progress made during the program journey."
    },
    {
      "id": 13,
      "month": "MARCH END",
      "title": "INDIVIDUAL DEVELOPMENT REPORT CREATION",
      "description": "The POD team will share an Individual Development Report at the end of the journey. The report will have the following information-   \n\n1. SNS 1 vs SNS 2 comparison  \n2. Versatility 1 vs Versatility 2 comparison  \n3. Executive Coach report  \n4. Mentoring Report"
    }
  ]
}
